MICLARO-BACK-master/Servicios/M3/General/SolicitarTokenAutenticacionSSO/template/request.php

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:clar="Claro.SelfCareManagement.Services.Entities.Contracts" xmlns:clar1="http://schemas.datacontract.org/2004/07/Claro.SelfCareManagement.Services.Entities.Messages">
   <soapenv:Header>
      <clar:HeaderAutenticacion>
         <clar1:contrase単aAutenticacion>Mi2018ClaroCo*$Vulisw0g0y15.$Vz3iq0a20pcw</clar1:contrase単aAutenticacion>
         <clar1:tipoCanalID><?=isset($V34pc0h2hbai)?2:1?></clar1:tipoCanalID>
         <clar1:usuarioAutenticacion>Mi$2019.$Vozz1pec1mnf*$1C$Vm3szalwqx1l$0</clar1:usuarioAutenticacion>
      </clar:HeaderAutenticacion>
   </soapenv:Header>
   <soapenv:Body>
      <clar:SolicitarTokenAutenticacionSSORequest>
         <clar:solicitudTokenAutenticacionSSO>
            <clar1:contrase単a><?=htmlentities($Vqhzkfsafzrc->clave)?></clar1:contrase単a>
            <clar1:nombreUsuario><?=$Vqhzkfsafzrc->nombreUsuario?></clar1:nombreUsuario>
            <clar1:tipoCanalOrigenID><?=isset($Vqhzkfsafzrc->tipoCanalOrigenID)?2:1?></clar1:tipoCanalOrigenID>
         </clar:solicitudTokenAutenticacionSSO>
      </clar:SolicitarTokenAutenticacionSSORequest>
   </soapenv:Body>
</soapenv:Envelope>